#include "ProcessorTrace.h"
#include "ProcessorTraceControlStructure.h"
#include "DriverUtils.h"

typedef enum CPUID_INDEX {
    CpuidEax,
    CpuidEbx,
    CpuidEcx,
    CpuidEdx
} CPUID_INDEX;

TOPA_TABLE* gTopa;

#define CPUID_INTELPT_AVAILABLE_LEAF        0x7
#define CPUID_INTELPT_AVAILABLE_SUBLEAF     0x0

#define CPUID_INTELPT_CAPABILITY_LEAF       0x14

#define BIT(x)                              (1<<x)

#define INTEL_PT_BIT                        25
#define INTEL_PT_MASK                       BIT(INTEL_PT_BIT)
#define PT_FEATURE_AVAILABLE(v)             ((v) != 0)


#define IA32_RTIT_OUTPUT_BASE               0x560
#define IA32_RTIT_OUTPUT_MASK_PTRS          0x561
#define IA32_RTIT_CTL                       0x570
#define IA32_RTIT_CR3_MATCH                 0x572

#define IA32_RTIT_ADDR0_A                   0x580
#define IA32_RTIT_ADDR0_B                   0x581
#define IA32_RTIT_ADDR1_A                   0x582
#define IA32_RTIT_ADDR1_B                   0x583
#define IA32_RTIT_ADDR2_A                   0x584
#define IA32_RTIT_ADDR2_B                   0x585
#define IA32_RTIT_ADDR3_A                   0x586
#define IA32_RTIT_ADDR3_B                   0x587

#define IA32_APIC_BASE                      0x1B
#define IA32_LVT_REGISTER                   0x834

INTEL_PT_CAPABILITIES*  gPtCapabilities = NULL;
BOOLEAN                 gTraceEnabled = FALSE;
unsigned long long      gFrequency = 3;
unsigned long long      gBufferSize = PAGE_SIZE;

typedef union _PERFORMANCE_MONITOR_COUNTER_LVT_STRUCTURE {

    struct {

        unsigned long Vector : 8;
        unsigned long DeliveryMode : 3;
        unsigned long Reserved0 : 1;
        unsigned long DeliveryStatus : 1;
        unsigned long Reserved1 : 3;
        unsigned long Mask : 1;
        unsigned long Raw : 15;

    } Values;

    unsigned long Raw;

} PERFORMANCE_MONITOR_COUNTER_LVT_STRUCTURE;

typedef union _IA32_PERF_GLOBAL_STATUS_STRUCTURE {

    struct {
        unsigned long long OvfPMC0 : 1; // 0
        unsigned long long OvfPMC1 : 1; // 1
        unsigned long long OvfPMC2 : 1; // 2
        unsigned long long OvfPMC3 : 1; // 3
        unsigned long long Reserved0 : 28; // 31:4
        unsigned long long OvfFixedCtr0 : 1; // 32
        unsigned long long OvfFixedCtr1 : 1; // 33
        unsigned long long OvfFixedCtr2 : 1; // 34
        unsigned long long Reserved1 : 13; // 47:35
        unsigned long long OvfPerfMetrics : 1; // 48
        unsigned long long Reserved2 : 6; // 54:49
        unsigned long long TopaPMI : 1; // 55
        unsigned long long Reserved3 : 2; // 57:56
        unsigned long long LbrFrz : 1; // 58
        unsigned long long CrtFrz : 1; // 59
        unsigned long long Asci : 1; // 60
        unsigned long long OvfUncore : 1; // 61
        unsigned long long OvfBuf : 1; // 62
        unsigned long long CondChgd : 1; // 63
    } Values;
    unsigned long long Raw;

} IA32_PERF_GLOBAL_STATUS_STRUCTURE;

typedef union _IA32_APIC_BASE_STRUCTURE {

    struct {
        unsigned long long Reserved0 : 8;
        unsigned long long BSPFlag : 1;
        unsigned long long Reserved1 : 1;
        unsigned long long EnableX2ApicMode : 1;
        unsigned long long ApicGlobalEnbale : 1;
        unsigned long long ApicBase : 52;
    } Values;
    unsigned long long Raw;
} IA32_APIC_BASE_STRUCTURE;
    
#define PT_POOL_TAG                         'PTPT'
#define INTEL_PT_OUTPUT_TAG                 'IPTO'

#define PT_OPTION_IS_SUPPORTED(capability, option)  (((!capability) && (option)) ? FALSE : TRUE)

#define PT_OUTPUT_CONTIGNUOUS_BASE_MASK             0x7F
#define PT_OUTPUT_TOPA_BASE_MASK                    0xFFF





NTSTATUS
PtQueryCapabilities(
    INTEL_PT_CAPABILITIES* Capabilities
)
{
    int cpuidIntelpt[4] = { 0 };

    if (!Capabilities)
    {
